app/views/games/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."game_id" = $1  [["game_id", 1]]
---
            <div class="comment_list_container">
            <% @game.comments.each do |comment| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 7], ["LIMIT", 1]]
---

                <% comment_user = User.find(comment.user_id) %>